app/views/checkout/confirmation.html.erb

SELECT "order_lines".* FROM "order_lines" WHERE "order_lines"."order_id" = 4
---
    </div>
    <% @order.order_lines.each do |l| %>