app/controllers/admin/about_controller.rb

SELECT "abouts".* FROM "abouts" ORDER BY "abouts"."id" ASC LIMIT 1
UPDATE "abouts" SET "title" = 'New Title', "lead" = 'New lead', "body" = '["Para one","Para two"]', "signature" = 'Bianna', "studio" = 'Studio line', "updated_at" = '2026-06-08 05:14:58.496084' WHERE "abouts"."id" = 1
---
    def update
      @about = About.instance
      @about.update(
        title: params[:title],
        lead: params[:lead],
        body: Array(params[:body]).map(&:to_s).reject { |p| p.strip.empty? },
        signature: params[:signature],
        studio: params[:studio]
      )