app/controllers/admin/base_controller.rb

SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = 'new'
---
    def new_order_count
      Order.where(status: "new").count