app/controllers/admin/categories_controller.rb

    def create
      @category = Category.new(category_params)
      if @category.save
---
INSERT INTO "categories" ("blurb", "created_at", "name", "position", "slug", "updated_at", "tone") VALUES ('For the slow brew.', '2026-06-08 06:33:13.194474', 'Teapots & More', 5, 'teapots-more', '2026-06-08 06:33:13.194474', '#e7dfd2') RETURNING "id"

    def update
      if @category.update(category_params)
---
UPDATE "categories" SET "blurb" = 'Slow brew.', "name" = 'Teapots', "slug" = 'teapots', "updated_at" = '2026-06-08 06:33:14.199783', "tone" = '#e3dccd' WHERE "categories"."id" = 6