app/controllers/admin/dashboard_controller.rb

    def index
      @orders = Order.all
      @revenue = Order.active.sum(:total)
      @new_count = Order.where(status: "new").count
      @prep_count = Order.where(status: "preparing").count
      @recent = Order.limit(5)

      # best sellers by units across all order lines
      tally = Hash.new(0)
      OrderLine.find_each { |l| tally[l.name] += l.qty }
---
SELECT COUNT(*) FROM "orders"
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = 'new'
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = 'preparing'
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT 5
SELECT SUM("order_lines"."qty") FROM "order_lines" WHERE "order_lines"."order_id" = 1
SELECT "order_lines".* FROM "order_lines" ORDER BY "order_lines"."id" ASC LIMIT 1000