app/controllers/admin/orders_controller.rb

SELECT COUNT(*) FROM "orders"
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = 'new'
---
    def index
      @filter = params[:filter].presence_in(["all"] + Order::STATUS_ORDER) || "all"
      @orders = @filter == "all" ? Order.all : Order.where(status: @filter)
      @counts = { "all" => Order.count }
      Order::STATUS_ORDER.each { |s| @counts[s] = Order.where(status: s).count }

SELECT "orders".* FROM "orders" WHERE "orders"."number" = 'PR-1042' ORDER BY "orders"."created_at" DESC LIMIT 1
---
    def show
      @order = Order.find_by!(number: params[:number])

SELECT "orders".* FROM "orders" WHERE "orders"."number" = 'PR-1046' ORDER BY "orders"."created_at" DESC LIMIT 1
UPDATE "orders" SET "status" = 'preparing', "updated_at" = '2026-06-08 05:14:58.467660' WHERE "orders"."id" = 4
---
    def update
      @order = Order.find_by!(number: params[:number])
      @order.update(status: params[:status]) if Order::STATUS_ORDER.include?(params[:status])

DELETE FROM "orders" WHERE "orders"."id" = 4
SELECT "orders".* FROM "orders" WHERE "orders"."number" = 'PR-1046' ORDER BY "orders"."created_at" DESC LIMIT 1
---
    def destroy
      Order.find_by!(number: params[:number]).destroy