app/controllers/admin/product_sets_controller.rb

SELECT "product_sets".* FROM "product_sets" ORDER BY "product_sets"."id" ASC
---
    def index
      @sets = ProductSet.order(:id)

INSERT INTO "product_sets" ("name", "price", "short", "long_desc", "created_at", "updated_at") VALUES ('Test Set', 80, 'short', 'long', '2026-06-08 05:14:58.427666', '2026-06-08 05:14:58.427666') RETURNING "id"
---
    def create
      @set = ProductSet.new(set_params)
      if @set.save

SELECT "product_sets".* FROM "product_sets" WHERE "product_sets"."id" = 4 LIMIT 1
---
    def set_set
      @set = ProductSet.find(params[:id])

INSERT INTO "set_items" ("product_set_id", "product_id", "quantity", "position", "created_at", "updated_at") VALUES (4, 1, 2, 0, '2026-06-08 05:14:58.431009', '2026-06-08 05:14:58.431009') RETURNING "id"
---
    def rebuild_items(set)
      ids = Array(params.dig(:set, :item_ids)).reject(&:blank?)
      counts = ids.each_with_object({}) { |id, h| h[id] = (h[id] || 0) + 1 }
      set.set_items.destroy_all
      counts.each_with_index do |(pid, qty), i|
        next unless Product.exists?(pid)
        set.set_items.create!(product_id: pid, quantity: qty, position: i)