app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" ASC
---
    def index
      @categories = Category.all
      @products = Product.includes(:category, images_attachments: :blob).order(:id)

INSERT INTO "products" ("category_id", "created_at", "long_desc", "name", "price", "short", "updated_at") VALUES (1, '2026-06-08 06:33:44.526625', 'A bowl with photos', 'Photo Test Bowl', 50, 'three photos', '2026-06-08 06:33:44.526625') RETURNING "id"
---
    def create
      @product = Product.new(product_params)
      if @product.save

UPDATE "products" SET "updated_at" = '2026-06-08 06:33:46.622626' WHERE "products"."id" = 14
---
    def update
      if @product.update(product_params)