app/views/admin/dashboard/index.html.erb

SELECT COUNT(*) FROM "orders"
---
  <div class="stat-grid">
    <% stats = [
         ["Revenue", money(@revenue), "all active orders", false],
         ["Orders", @orders.size, "all time", false],
         ["New", @new_count, "awaiting action", @new_count.positive?],
         ["Preparing", @prep_count, "in the kiln", false],
       ] %>