app/views/admin/orders/index.html.erb

          <div class="ord-customer"><%= o.customer_name %></div>
          <div class="ord-items"><%= o.order_lines.map { |l| l.display_name + (l.qty > 1 ? " ×#{l.qty}" : "") }.join(", ") %></div>
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
SELECT "order_lines".* FROM "order_lines" WHERE "order_lines"."order_id" = 1