app/views/admin/orders/show.html.erb

SELECT "order_lines".* FROM "order_lines" WHERE "order_lines"."order_id" = 1
---
    <div class="panel-head"><span>Items</span></div>
    <% @order.order_lines.each do |l| %>