app/views/admin/product_sets/_form.html.erb

SELECT "products".* FROM "products" ORDER BY "products"."id" ASC
---
<%
  products = Product.includes(:category).order(:id)