app/views/admin/categories/_form.html.erb

        <% unless is_new %>
          <% has_products = @category.products.exists? %>
          <%= button_to admin_category_path(@category), method: :delete, class: "danger-btn",
                form: { data: { turbo_confirm: has_products ? "This category has #{@category.products.count} piece(s). Deleting it leaves them uncategorised — continue?" : "Delete this category?" } } do %>
---
SELECT 1 AS one FROM "products" WHERE "products"."category_id" = 6 LIMIT 1
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = 1