app/controllers/application_controller.rb

INSERT INTO "events" ("event_type", "sid", "page_key", "label", "piece", "name", "total", "occurred_at", "created_at", "updated_at") VALUES ('pageview', 's-a87f637e', 'product/1', 'Hakume Serving Bowl', TRUE, 'Hakume Serving Bowl', NULL, '2026-06-08 05:12:35.848749', '2026-06-08 05:12:35.848854', '2026-06-08 05:12:35.848854') RETURNING "id"
---
  def track(page_key, label, piece: false, name: nil)
    return if admin_signed_in?
    Event.create!(
      event_type: "pageview", sid: analytics_sid, page_key: page_key,
      label: label, piece: piece, name: name, occurred_at: Time.current
    )