app/controllers/checkout_controller.rb

  def create
    cart = current_cart
    if cart.empty?
      redirect_to checkout_path, alert: "Your cart is empty." and return
    end

    order = nil
    Order.transaction do
      order = Order.new(
        number: Order.next_number, status: "new",
        customer_name: params[:name].to_s.strip,
        customer_email: params[:email].to_s.strip,
        customer_phone: params[:phone].to_s.strip,
        note: params[:note].to_s.strip
      )
      total = 0
      lines = cart.detailed.map do |l|
        total += l.subtotal
        { kind: l.kind, item_id: l.id, name: l.record.name, price: l.record.price, qty: l.qty }
      end
      order.total = total
      order.save!
      lines.each { |attrs| order.order_lines.create!(attrs) }
    end

    Event.create!(event_type: "order", sid: analytics_sid, label: order.number,
                  total: order.total, occurred_at: Time.current)
---
INSERT INTO "orders" ("number", "status", "customer_name", "customer_email", "customer_phone", "note", "total", "created_at", "updated_at") VALUES ('PR-1046', 'new', 'Test Buyer', 'test@example.com', '+43 660 000000', 'please call', 150, '2026-06-08 05:13:47.511050', '2026-06-08 05:13:47.511050') RETURNING "id"
INSERT INTO "order_lines" ("order_id", "kind", "item_id", "name", "price", "qty", "created_at", "updated_at") VALUES (4, 'product', '1', 'Hakume Serving Bowl', 58, 1, '2026-06-08 05:13:47.513653', '2026-06-08 05:13:47.513653') RETURNING "id"
INSERT INTO "events" ("event_type", "sid", "page_key", "label", "piece", "name", "total", "occurred_at", "created_at", "updated_at") VALUES ('order', 's-aab57d2d', NULL, 'PR-1046', FALSE, NULL, 150, '2026-06-08 05:13:47.514609', '2026-06-08 05:13:47.514666', '2026-06-08 05:13:47.514666') RETURNING "id"

  def confirmation
    @order = Order.find_by!(number: params[:number])
---
SELECT "orders".* FROM "orders" WHERE "orders"."number" = 'PR-1046' ORDER BY "orders"."created_at" DESC LIMIT 1