app/controllers/home_controller.rb

  def index
    @categories = Category.all
    @featured = Product.order(:id).limit(4)
    @hero_set = ProductSet.order(:id).first
---
SELECT "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT 4
SELECT "product_sets".* FROM "product_sets" ORDER BY "product_sets"."id" ASC LIMIT 1