app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."category_id" = 1 AND "products"."id" != 1 ORDER BY "products"."id" ASC LIMIT 4
---
  def show
    @product = Product.with_attached_images.find_by(id: params[:id])
    return render "shared/not_found", status: :not_found unless @product

    @variants = @product.variants.includes(:variant_attribute_values, images_attachments: :blob)
    @category = @product.category
    @related = @category ? @category.products.where.not(id: @product.id).order(:id).limit(4) : []