app/controllers/sets_controller.rb

SELECT "product_sets".* FROM "product_sets" ORDER BY "product_sets"."id" ASC
---
  def index
    @sets = ProductSet.order(:id)

SELECT "product_sets".* FROM "product_sets" WHERE "product_sets"."id" = 1 LIMIT 1
---
  def show
    @set = ProductSet.find_by(id: params[:id])