app/controllers/shop_controller.rb

  def show
    @category = Category.find_by(slug: params[:slug])
    return render "shared/not_found", status: :not_found unless @category

    @products = @category.products.order(:id)
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = 1 ORDER BY "products"."id" ASC