app/models/cart.rb

SELECT "product_sets".* FROM "product_sets" WHERE "product_sets"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
  def detailed
    raw.filter_map do |l|
      rec = l["kind"] == "set" ? ProductSet.find_by(id: l["id"]) : Product.find_by(id: l["id"])