app/models/category.rb

SELECT 1 AS one FROM "categories" WHERE "categories"."id" IS NOT NULL AND "categories"."slug" = 'serving-boards' LIMIT 1
---
  def generate_slug
    base = name.to_s.parameterize.presence || "category"
    candidate = base
    i = 2
    while Category.unscoped.where.not(id: id).exists?(slug: candidate)

SELECT MAX("categories"."position") FROM "categories"
---
  def assign_position
    self.position = (Category.unscoped.maximum(:position) || -1) + 1