app/models/event.rb

SELECT COUNT(DISTINCT "events"."sid") FROM "events" WHERE (occurred_at >= '2026-06-01 05:12:04.706430')
---
  def self.summary(from)
    evs = since(from)
    visitors = evs.distinct.count(:sid)

SELECT COUNT(*) AS "count_all", "events"."page_key" AS "events_page_key", "events"."label" AS "events_label" FROM "events" WHERE (occurred_at >= '2026-06-01 05:12:04.708124') AND "events"."event_type" = 'pageview' GROUP BY "events"."page_key", "events"."label" ORDER BY count(*) desc LIMIT 3
---
  def self.top_pages(from, n = 6)
    since(from).pageviews.group(:page_key, :label)
      .order(Arel.sql("count(*) desc")).limit(n).count
      .map { |(key, label), count| { key:, label:, count: } }

SELECT COUNT(*) AS "count_all", "events"."page_key" AS "events_page_key", "events"."name" AS "events_name" FROM "events" WHERE (occurred_at >= '2026-06-01 05:12:50.601315') AND "events"."event_type" = 'pageview' AND "events"."piece" = TRUE GROUP BY "events"."page_key", "events"."name" ORDER BY count(*) desc LIMIT 6
---
  def self.top_pieces(from, n = 6)
    since(from).pageviews.where(piece: true).group(:page_key, :name)
      .order(Arel.sql("count(*) desc")).limit(n).count
      .map { |(key, name), count| { key:, label: name, count: } }