app/models/order_line.rb

SELECT "product_sets".* FROM "product_sets" WHERE "product_sets"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 8 LIMIT 1
---
  def record
    @record ||= kind == "set" ? ProductSet.find_by(id: item_id) : Product.find_by(id: item_id)