app/models/order.rb

SELECT COUNT(*) FROM "orders" WHERE (number LIKE 'PR-%')
---
  def self.next_number
    base = 1043
    "PR-#{base + Order.unscoped.where("number LIKE ?", "PR-%").count}"