app/models/product_set.rb

  def grouped_items
    set_items.includes(product: { images_attachments: :blob }).map do |si|
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (4, 12, 2)

  def separate_total
    set_items.includes(:product).sum { |si| (si.product&.price || 0) * si.quantity }
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (4, 12, 2)